<template>
    <li> 
            
               {{item.title}}
            
            <button class="del">&times;</button>
              <!--с помощью $emit мы можем сообщать родительскому элементу, что была нажата кнопка, произошло событие. 
                  Первый параментр- придуманное нами имя события 'delete_todo'  
                  Второй параментр - данные по которым нужно будет вносить изменения --> 
        </li>
</template>

<script>
export default {
    props: {
    item: {  //валидация 
            type: Object, //поясняем что тип должен быть обьектом
            required: true // должен быть передан i, иначе компонент не сможеи рабоатть 
       }
    }
   }
</script>